import Component, { html, css } from '../class/Component.js';
import Api from '../class/Api.js';
import $ from '../class/DOM.js';
import locator from '../script/locator.js';

const attributes = {};
const properties = {};

const style = css`
  .a__icon {
    color: red;
    width: 48px;
    height: 48px;
  }
  a svg {
    display: block;
  }
  .active {
    background: var(--bell-red) !important;
    color: white !important;
  }
  .menuItem {
    background: white;
    text-decoration: none;
    border-top: 1px solid var(--ligth-gray);
    display: flex;
    flex-direction: column;
    width: 100%;
    align-items: center;
    padding: 5px;
    font-size: 12px;
  }
  .menuItem:visited {
    color: black;
  }
  .menuItem:link {
    color: black;
  }
  .menuItem:focus {
    background: var(--bell-red);
    color: white;
  }
  .menuItem:active {
    background: var(--bell-red);
    color: white;
  }
  :host {
    display: flex;
    justify-content: space-around;
    /* background-color: whitesmoke; */
    font-family: var(--font);
  }`;

/** Разводное меню {AppBar} @class @ui @component <app-bar />
  * description
  */
export default class AppBar extends Component {
  static template = html`
  <template>
    <style>${style}</style>
    <a id="bar1" class="menuItem" href="#main/camera">
      <svg class="a__icon" viewBox="0 0 24 24">
        <path
          d="M4 12C4 7.58172 7.58172 4 12 4C14.1217 4 16.1566 4.84285 17.6569 6.34315C19.1571 7.84344 20 9.87827 20 12C20 16.4183 16.4183 20 12 20C7.58172 20 4 16.4183 4 12ZM13.976 13.08L15.576 9.13601C15.6381 8.9876 15.6032 8.81631 15.488 8.70401L15.296 8.51201C15.1837 8.39681 15.0124 8.36192 14.864 8.42401L10.92 10.024C10.5245 10.1865 10.2105 10.5005 10.048 10.896L8.44798 14.84C8.38589 14.9884 8.42078 15.1597 8.53598 15.272L8.72798 15.464C8.84028 15.5792 9.01157 15.6141 9.15998 15.552L13.104 13.952C13.4995 13.7895 13.8135 13.4755 13.976 13.08Z"
        ></path>
      </svg>
      Камера
    </a>
    <a id="bar2" class="menuItem" href="#main/stickers">
      <svg class="a__icon" viewBox="0 0 24 24">
        <path
          d="M7.19837 5.99679C7.19837 4.89399 8.09411 4 9.19905 4C10.304 4 11.1997 4.89399 11.1997 5.99679C11.1997 7.09958 10.304 7.99359 9.19905 7.99359C8.66844 7.99359 8.15956 7.7832 7.78436 7.40873C7.40915 7.03426 7.19837 6.52637 7.19837 5.99679ZM13.5125 12.4264L12.7122 10.9089C12.3107 10.1133 11.5 9.60565 10.6075 9.59102H7.79058C6.88365 9.59074 6.05397 10.1005 5.64585 10.9089L4.8856 12.4264C4.76078 12.6737 4.77312 12.9678 4.91822 13.2037C5.06331 13.4396 5.32047 13.5837 5.59784 13.5846H12.8003C13.0776 13.5837 13.3348 13.4396 13.4799 13.2037C13.625 12.9678 13.6373 12.6737 13.5125 12.4264ZM16.8016 5.99679C16.8016 7.09958 15.9059 7.9936 14.8009 7.9936C14.2697 7.99572 13.7596 7.78602 13.3839 7.41109C13.0082 7.03615 12.7981 6.52702 12.8003 5.99679C12.8003 4.89399 13.696 4 14.8009 4C15.9059 4 16.8016 4.89399 16.8016 5.99679ZM19.1144 12.4264L18.3541 10.9089C17.946 10.1005 17.1163 9.59074 16.2094 9.59102H13.8086C13.955 9.78116 14.0836 9.98436 14.1927 10.198L14.953 11.7076C15.2424 12.293 15.2799 12.9709 15.057 13.5846H18.4021C18.6795 13.5837 18.9367 13.4396 19.0817 13.2037C19.2268 12.9678 19.2392 12.6737 19.1144 12.4264ZM13.2884 15.182H16.4014C16.5158 15.1709 16.6297 15.2075 16.7161 15.2832C16.8025 15.3588 16.8537 15.4667 16.8576 15.5814V18.6884C16.8636 18.8521 16.7668 19.0022 16.615 19.0646C16.4632 19.127 16.2886 19.0884 16.1774 18.9679L15.3771 18.1692C13.9756 19.7083 11.834 20.3437 9.81769 19.8188C7.80138 19.2939 6.24361 17.6954 5.77386 15.6692C5.75162 15.5511 5.78071 15.4292 5.85388 15.3338C5.92859 15.2375 6.04396 15.1814 6.16599 15.182H6.96626C7.1356 15.1775 7.28946 15.2798 7.35039 15.4376C7.74337 16.84 8.86997 17.9177 10.2905 18.2501C11.7109 18.5825 13.2001 18.1169 14.1767 17.035L13.0083 15.8609C12.8962 15.7468 12.8631 15.577 12.924 15.4293C12.985 15.2815 13.1283 15.1843 13.2884 15.182Z"
        ></path>
      </svg>
      Стикеры
    </a>
    <a id="bar3" class="menuItem" href="#main/friends">
      <svg class="a__icon" viewBox="0 0 24 24">
        <path
          d="M15.2 4H5.6C4.71634 4 4 4.71634 4 5.6V18.4C4 19.2837 4.71634 20 5.6 20H15.2C16.0837 20 16.8 19.2837 16.8 18.4V5.6C16.8 4.71634 16.0837 4 15.2 4ZM10.4 11.6C10.4017 11.7488 10.3207 11.8862 10.1897 11.9568C10.0586 12.0273 9.89928 12.0193 9.776 11.936L8.224 10.896C8.08742 10.8087 7.91258 10.8087 7.776 10.896L6.224 11.936C6.10072 12.0193 5.94136 12.0273 5.81034 11.9568C5.67931 11.8862 5.59828 11.7488 5.59997 11.6V5.99998C5.59997 5.77907 5.77909 5.59998 6 5.59998H10C10.2209 5.59998 10.4 5.77907 10.4 5.99998V11.6ZM18.4 5.59998H19.2C19.6418 5.59998 20 5.95815 20 6.39998V17.6C20 18.0418 19.6418 18.4 19.2 18.4H18.4V5.59998Z"
        ></path>
      </svg>
      Друзья
    </a>
    <a id="bar4" class="menuItem" href="#main/profile">
      <svg class="a__icon" viewBox="0 0 24 24">
        <path
          fill-rule="evenodd"
          clip-rule="evenodd"
          d="M18.0909 6H6.63636C5.73262 6 5 6.73262 5 7.63636V15.8182C5 16.7219 5.73262 17.4545 6.63636 17.4545H18.0909C18.9946 17.4545 19.7273 16.7219 19.7273 15.8182V7.63636C19.7273 6.73262 18.9946 6 18.0909 6ZM18.0909 15.8182H6.63636V10.6882L11.0136 13.7564C11.8244 14.3231 12.9028 14.3231 13.7136 13.7564L18.0909 10.6882V15.8182ZM12.8954 12.5864L18.0909 8.94545V7.63636H6.63636V8.94545L11.8318 12.5864C12.1516 12.8083 12.5756 12.8083 12.8954 12.5864Z"
        ></path>
      </svg>
      Профиль
    </a>
  </template>`;

  /** Создание элемента в DOM (DOM доступен) / mount @lifecycle
    * @param {ShadowRoot} node корневой узел элемента
    * @return {AppBar} #this текущий компонент
    */
  mount(node) {
    super.mount(node, attributes, properties);
    // this.main();

    locator.channel.on('app-routing', path => {
      const page = path[1] || 'profile';
      $(`a[href="#main/${page}"]`, node)?.classList?.add('active');
    });


    return this;
  }

  async main() {
    const menu = await Api.get('/menu/menu');
    console.log(menu);
  }
}

Component.init(AppBar, 'app-bar', { attributes, properties });
